#include <stdio.h> //введення бібліотек
#include <locale.h>
#include <math.h>
int j;
float k, l; //введення глобальних змінних
 int main() {
    float a, b; //введення змінних
    printf("Задайте перше число="); //рядок для введення першого числа
    scanf("%f",&a); //cканування цілого числа
    printf("Задайте друге число="); //рядок для введення другого числа
    scanf("%f",&b); //cканування цілого числа
    j=fmod(b,a); //функція для залишку від ділення для дійсних чисел
    k=b-a; //формула для різниці чисел
    l=pow(a,2)+pow(b,2); //формула для добутку чисел у квадраті
    printf("Залишок від ділення 2-го числа на 1-е = %d \n", j); //виведення чисел з функцій
    printf("Різниця між другим та першим числом= %.2f \n", k);
    printf("Добуток чисел = %.2f \n", l);
   return 0;
   }
