#include <stdio.h> //введення бібліотек
#include <locale.h>
#include <math.h>
  float a; //введення глобальної змінної
 int main() {
    float x,y,z; //введення змінної
    printf("Задайте число x="); //рядок для введення цілого числа x
    scanf("%f",&x); //cканування цілого числа
    printf("Задайте число y="); //рядок для введення цілого числа y
    scanf("%f",&y); //cканування цілого числа
    printf("Задайте число z="); //рядок для введення цілого числа z
    scanf("%f",&z); //cканування цілого числа
    a=(sqrt(x)+2*sqrt(y*z))/(sqrt(y)-2*sqrt(x*z)); //введення формули
    printf("Обчислення=%.2f \n", a); //виведення обчислення з формули
   return 0;
     }