#include <stdio.h> //введення бібліотек
#include <locale.h>
#include <math.h>
  float y; //введення глобальної зміни
 int main() {
    float a,b,c; //введення змінних
    printf("Задайте число a="); //рядок для введення цілого числа а
    scanf("%f",&a); //cканування цілого числа
    printf("Задайте число b="); //рядок для введення цілого числа b
    scanf("%f",&b); //cканування цілого числа
    printf("Задайте число c="); //рядок для введення цілого числа c
    scanf("%f",&c); //cканування цілого числа
    y=((a*b*c)/(a+b+c))-((a-b-c)/(a*b*c)); //введення формули
    printf("Обчислення=%.2f \n", y); //виведення обчислення з формули
   return 0;
     }